{"batchcomplete": "", "query": {"pages": {"18935488": {"ns": 0, "pageid": 18935488, "revisions": [{"comment": "", "*": "'''Reverse engineering''' (RE) is the process of discovering the technological principles of a device or object or system through analysis of its structure, function and operation. It often involves taking something (e.g. a [[machine|mechanical device]], an [[electronic component]], a [[software]] program) apart and analyzing its workings in detail, usually to try to make a new device or program that does the same thing without copying anything from the original. The [[verb]] form is '''to reverse engineer'''.\n<!--\nRE is mainly used to flout the law?  Don't think so...\nReverse engineering is commonly done to avoid [[copyright]]s on desired functionality, and may be used for avoiding [[patent]] law, though this is a bit risky: patents apply to the functionality, not a specific implementation of it.\n--> \n\nIn the United States and many other countries, even if an artifact or process is protected by [[trade secret]]s, reverse-engineering the artifact or process is often lawful as long as it is obtained legitimately. [[Patent]]s, on the other hand, need a public disclosure of an [[invention]], and therefore patented items do not necessarily have to be reverse engineered to be studied. One common motivation of reverse engineers is to determine whether a competitor's product contains [[patent infringement]]s or [[copyright infringement]]s.\n==Types and applications of reverse engineering==\nAs [[computer-aided design]] has become more popular, reverse engineering has become a viable method to create a 3D virtual model of an existing physical part for use in 3D [[computer-aided design|CAD]], [[computer-aided manufacturing|CAM]], [[computer-aided engineering|CAE]] and other software. The reverse engineering process involves measuring an object and then reconstructing it as a 3D model.  The physical object can be measured using [[3d scanner|3D scanning]] technologies like [[coordinate-measuring machine|CMMs]], [[3d scanner#Triangulation|laser scanners]], [[3d scanner#Structured light|structured light digitizer]]s or [[computed tomography]].  The measured data alone, usually represented as a [[point cloud]], lacks topological information and is therefore often processed and modeled into a more usable format such as a triangular faced mesh, a set of [[NURBS]] surfaces or a CAD model.<!--The point clouds themselves are not compatible with most 3D software, so a-->  Applications like Imageware, [http://www.Rapidform.com Rapidform] or Geomagic are used to process the point clouds themselves into formats usable in other applications such as 3D CAD, CAM, CAE or visualization.\n\nReverse engineering is often used by [[military]] in order to copy other nations' [[technology]], devices or information, or parts of which, have been obtained by regular troops in the fields or by [[military intelligence|intelligence]] operations. It was often used during the [[Second World War]] and the [[Cold War]]. Well-known examples from WWII include:\n\n* [[Jerry can]]: British and American forces noticed that the Germans had gasoline cans with an excellent design.   They reverse engineered copies of those cans.  The cans were popularly known as ''Jerry cans''.\n* [[Tupolev Tu-4]]: A number of American [[B-29 Superfortress|B-29]] bombers on missions over [[Japan]] were forced to land in the [[Soviet Union|USSR]].  The Soviets, who did not have a similar strategic bomber, decided to copy the B-29.  Within a few years they had developed the Tu-4, a near perfect copy.\n* [[V2 Rocket]]:  Technical documents for the V2 and related technologies were captured by the Western Allies at the end of the war.  Soviet and captured German engineers had to reproduce technical documents and plans, working from captured hardware, in order to make their clone of the rocket, the [[R-1 (missile)|R-1]], which began the postwar Soviet rocket program that led to the [[R-7 Semyorka|R-7]] and the beginning of the [[space race]].\n\nReverse engineering software or hardware systems which is done for the purposes of [[interoperability]] (for example, to support undocumented file formats or undocumented hardware peripherals), is mostly believed to be legal, though patent owners often contest this and attempt to stifle any reverse engineering of their products for any reason.\n\nOn a related note, [[black box testing]] in [[software engineering]] has a lot in common with reverse-engineering. The tester usually has the [[application programming interface|API]], but his goals are to find bugs and undocumented features by bashing the product from outside.\n\nOther purposes of reverse engineering include security auditing, removal of copy protection (\"[[software cracking|cracking]]\"), circumvention of access restrictions often present in [[consumer electronics]], customization of [[embedded systems]] (such as engine management systems), in-house repairs or retrofits, enabling of additional features on low-cost \"crippled\" hardware (such as some graphics card chipsets), or even mere satisfaction of curiosity.\n\nReverse engineering is also used by businesses to bring existing physical geometry into digital product development environments, to make a digital 3D record of their own products or assess competitors' products. It is used to analyze, for instance, how a product works, what it does, what components it consists of, estimate costs, identify potential [[patent]] infringement, etc.\n\n[[Value engineering]] is a related activity also used by business. It involves deconstructing and analysing products, but the objective is to find opportunities for cost cutting.\n\nFinally, reverse engineering often is done because the documentation of a particular device has been lost (or was never written), and the person who built the thing is no longer working at the company.  Integrated circuits often seem to have been designed on obsolete, proprietary systems, which means that the only way to incorporate the functionality into new technology is to reverse-engineer the existing chip and then re-design it.\n\n==Reverse engineering of software==\n{{wikibookspar||Reverse Engineering}}\nThe term \"reverse engineering\" as applied to software means different things to different people, prompting Chikofsky and Cross to write a paper researching the various uses and defining a [[taxonomy]]. From their paper,\n\n: Reverse engineering is the process of analyzing a subject system to create representations of the system at a higher level of abstraction.<ref>{{cite journal | last=Chikofsky | first=E.J. | coauthors=J.H. Cross II | year=1990 | month=January | title=Reverse Engineering and Design Recovery: A Taxonomy in IEEE Software | journal=IEEE Computer Society | pages=13–17}}</ref>\n\nIt can also be seen as \"going backwards through the development cycle\".<ref>{{cite book | last=Warden | first=R. | title=Software Reuse and Reverse Engineering in Practice | year=1992 | publisher=Chapman & Hall | location=London, England | pages=283–305}}</ref> In this model, the output of the implementation phase (in source code form) is reverse engineered back to the analysis phase, in an inversion of the traditional [[waterfall model]].\n\nReverse engineering is a process of examination only: the software system under consideration is not modified (which would make it [[reengineering (software)|reengineering]]).\n\nIn practice, two main types of reverse engineering emerge. In the first case, source code is already available for the software, but higher level aspects of the program, perhaps poorly documented or documented but no longer valid, are discovered. In the second case, there is no source code available for the software, and any efforts towards discovering one possible source code for the software are regarded as reverse engineering. This second usage of the term is the one most people are familiar with.\n\n===Binary software===\nThis process is sometimes termed ''Reverse Code Engineering'' or RCE.<ref>{{cite book | last=Chuvakin | first=Anton | coauthors=Cyrus Peikari | edition=1st ed. | title=Security Warrior | url=http://www.oreilly.com/catalog/swarrior/reviews.html | accessdate=2006-05-25 | publisher=O'Reilly | year=2004 | month=January}}</ref> As an example, decompilation of binaries for the [[Java platform]] can be accomplished using Jad. One famous case of reverse engineering was the first non-[[International Business Machines|IBM]] implementation of the [[IBM PC|PC]] [[BIOS]] which launched the historic [[IBM PC compatible]] industry that has been the overwhelmingly dominant computer hardware platform for many years.\n\nIn the [[United States]], the [[Digital Millennium Copyright Act]] exempts from the circumvention ban some acts of reverse engineering aimed at interoperability of file formats and protocols, but judges in key cases have ignored this law, since it is acceptable to circumvent restrictions for use, but not for access.<ref>{{cite web | url=http://www4.law.cornell.edu/uscode/html/uscode17/usc_sec_17_00001201----000-.html | title=US Code: Title 17,1201. Circumvention of copyright protection systems | accessdate=2006-05-25}}</ref> Aside from restrictions on circumvention, reverse engineering of software is protected in the U.S. by the [[fair use]] exception in [[copyright|copyright law]].<ref>See [[Pamela Samuelson]] and Suzanne Scotchmer, \"The Law and Economics of Reverse Engineering\", 111 ''Yale Law Journal'' 1575-1663 (May 2002).</ref>\n\nThe [[Samba software]], which allows systems that are not running [[Microsoft Windows]] systems to share files with systems that are, is a classic example of software reverse engineering{{Fact|date=April 2007}}, since the Samba project had to reverse-engineer unpublished information about how Windows file sharing worked, so that non-Windows computers could emulate it. The [[Wine (software)|Wine]] project does the same thing for the [[Windows API]], and [[OpenOffice.org]] is one party doing this for the [[Microsoft Office]] file formats. The [[ReactOS]] project is even more ambitious in its goals as it strives to provide binary (ABI and API) compatibility with the current Windows OSes of the NT branch, allowing software and drivers written for Windows to run on a clean room reverse engineered GPL open source counterpart.\n\n===Binary software techniques===\nReverse engineering of software can be accomplished by various methods.  The three main groups of software reverse engineering are\n\n#Analysis through observation of information exchange, most prevalent in protocol reverse engineering, which involve using [[bus analyzer]]s and [[packet sniffer]]s for example for listening into a [[computer bus]] or [[computer network]] connection, revealing the traffic data underneath. Behaviour on the bus or network can then be analyzed for producing a stand-alone implementation that mimics the same behaviour. This is especially good for reverse engineering of [[device driver]]s. Sometimes reverse-engineering on [[embedded system]]s is greatly helped by tools deliberately introduced by the manufacturer, such as [[JTAG]] ports or other debugging means. In [[Microsoft Windows]] low-level debuggers such as [[SoftICE]] are popular.\n#[[Disassembly]] using a [[disassembler]], meaning the raw [[machine language]] of the program is read and understood in its own terms, only with the aid of machine language [[mnemonic]]s. This works on any computer program but can take quite some time, especially for someone not used to machine code. The [[Interactive Disassembler]] is a particularly popular tool.\n#Decompilation using a [[decompiler]], a process that tries, with varying result, to recreate the source code in some high level language for a program only available in machine code or bytecode.\n\n== Notes ==\n{{reflist}}\n\n==See also==\n*[[Antikythera mechanism]]: a famous example of Reverse engineering.\n*[[Code morphing]]\n*[[Clean room design]]\n*[[Decompiler]]\n*[[Digital Millennium Copyright Act]]\n*[[Interactive Disassembler]]\n*[[Value engineering]]\n*[[List of production topics]]\n*[[Forensic engineering]]\n*[[Paycheck (film)|Paycheck]], a movie about reverse engineering\n*[[Connectix Virtual Game Station]]\n*[[Bus analyzer]]\n*[[Logic analyzer]]\n*[[Knowledge Discovery Metamodel]], a common intermediate representation standard for reverse engineering by OMG\n\n==External links==\n* [http://www.reverse-engineering.net/ Reverse Code Engineering], as entry point for Reverse Code Engineering and the largest Reverse Code Engineering Community\n* [http://www.woodmann.com Reverse Code Engineering: The complete resource for RE of software. Archives of the most important Reverse Code Engineering sites]\n* [http://www.openrce.org OpenRCE: Reverse Engineering Portal]\n* [http://www.eclipse.org/gmt/modisco/ MoDisco: (Model Discovery), an Eclipse Project on Model Driven Reverse Engineering]\n* [http://www.program-transformation.org/Transform/ReverseEngineering Program transformation wiki on Reverse Engineering]\n* [http://www.acm.uiuc.edu/sigmil/RevEng/ Introduction to Reverse Engineering Software], preprint of a book by [[Mike Perry]] and [[Nasko Oskov]].\n* [http://www.ercim.org/publication/Ercim_News/enw44/varady.html Reverse Engineering Shapes], article by [[Tamás Várady]]\n* [http://www.reteam.org/ Online Resource for Reverse Engineering Software]\n* [http://www.jenkins-ip.com/serv/serv_6.htm Article on legal considerations] by [[David C. Musker]]\n* [http://archives.cnn.com/2001/US/01/25/smithsonian.cold.war/ CNN: How Soviets copied America's best bomber during WWII]\n* [http://w3.umh.ac.be/genlog/SE/SE-contents.html#ReverseEngineering Very good RE definitions from Software Engineering] \n* [http://www.abrg.group.shef.ac.uk/reverb/public/ Reverse engineering the vertebrate brain]\n* [http://adm.omg.org Architecture-Driven Modernization group at OMG]\n* [http://www.elecdesign.com/Articles/Index.cfm?ArticleID=11966 Reverse Engineering Delivers Product Knowledge Aids Technology Spread] - Article in Electronic Design by Dick James, Senior Technology Adviser, Chipworks\n* [http://www.nektra.com/products/spystudio/ SpyStudio Application Analysis] - Tool to analyze internal application behavior\n\n[[Category:Engineering]]\n[[Category:Production and manufacturing]]\n[[Category:Software engineering]]\n\n[[ca:Enginyeria inversa]]\n[[cs:Zpětné inženýrství]]\n[[de:Reverse Engineering]]\n[[es:Ingeniería inversa]]\n[[fr:Rétro-ingénierie]]\n[[it:Reingegnerizzazione]]\n[[he:הנדסה הפוכה]]\n[[ms:Kejuruteraan undur]]\n[[nl:Reverse engineering]]\n[[ja:リバースエンジニアリング]]\n[[pl:Reverse engineering]]\n[[pt:Engenharia reversa]]\n[[ru:Обратная разработка]]\n[[fi:Takaisinmallinnus]]\n[[sv:Reverse engineering]]\n[[th:วิศวกรรมผันกลับ]]\n[[vi:Kỹ nghệ đảo ngược]]\n[[zh:逆向工程]]", "timestamp": "2007-05-07T22:48:01Z", "contentformat": "text/x-wiki", "revid": 129079981, "contentmodel": "wikitext", "user": "Pyabo", "parentid": 128457674}], "title": "Reverse engineering"}}}}