{"batchcomplete": "", "query": {"pages": {"18935488": {"ns": 0, "pageid": 18935488, "revisions": [{"comment": "", "*": "[[nl:Reverse engineering]]\r\n'''Reverse engineering (RE)''' is the process of using the information you obtain from a component to either recreate it or modify it.\r\n[[Co-ordinate Measuring Machines]] (CMM) can be used to [[digitise]] your component and the information can be utilised in computer aided modelling. \r\nNew and improved techniques in reverse engineering include [[Laser Scanning]] which, as the name implies, uses laser beams to scan across the surface of components of any shape and display the results in real time.\r\n\r\n\r\n===RE and software===\r\n\r\nReverse engineering can also apply to [[software]].\r\nReverse engineering of binaries for the [[Java platform]] can be accomplished using ARGOuml.org.\r\nIn the [[United States]], the [[Digital Millennium Copyright Act]] exempts from the its circumvention ban some acts of reverse engineering aimed at interoperability  ([http://www4.law.cornell.edu/uscode/17/1201.html 17 USC 1201](f)), but judges in key cases have ignored this law.\r\n\r\nThe [[Samba software]], which allows systems that are not running [[Microsoft Windows]] systems to share files with systems that are, is a classic example of software reverse engineering, since the Samba project had to reverse engineer unpublished information about how Windows file sharing worked, so that non-Windows computers could emulate this.\r\n\r\n\r\n===RE as a competitive activity===\r\nReverse engineering is also a competitive activity, used to analyze, for instance, how a competitor's product works, what it does, who manufactures it, what components it consists of, estimate costs, identify potential [[patent]] infringement, etc.\r\n\r\n===Miscellaneous===\r\nThe verb, \"to reverse-engineer\" should have a hyphen.", "timestamp": "2003-05-12T20:31:03Z", "contentformat": "text/x-wiki", "revid": 913663, "anon": "", "contentmodel": "wikitext", "user": "131.183.81.100", "parentid": 913660}], "title": "Reverse engineering"}}}}